app/Models/CrudModel.php

        public function insertar($datos){
            $Nombres = $this->db->table('t_personas');
            $Nombres->insert($datos);
---
INSERT INTO `t_personas` (`nombre`, `apellido`, `rfc`, `email`, `telefono`) VALUES ('Jesús Adrián', 'Gálvez Cuevas', 'GAHSJDFFA', 'galvezadrian2310@gmail.com', '6681915800')

        public function actualizar($data, $idNombre){
            $Nombres = $this->db->table('t_personas');
            $Nombres->set($data);
            $Nombres->where('idNombre',$idNombre);
            return $Nombres->update();
---
UPDATE `t_personas` SET `nombre` = 'Jesús Adrián', `apellido` = 'Gálvez', `rfc` = 'GAHSJDFFA1234', `email` = 'galvezadrian2310@gmail.com', `telefono` = '6681915800'
WHERE `idNombre` = '3'